app/Controllers/Auth/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'sufyan11201er11@gmail.com'
 LIMIT 1
UPDATE `users` SET `otp` = NULL, `is_verified` = 1
WHERE `users`.`id` IN ('17')
---
    public function verifyOtpSubmit()
    {
        $email = $this->request->getPost('email');
        $otpArray = $this->request->getPost('otp');
        $otp = implode('', $otpArray);

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $email)->first();

        if ($user && $user['otp'] === $otp) {
            $userModel->update($user['id'], [
                'otp' => null,
                'is_verified' => 1
            ]);