app/Models/CityModel.php

SELECT `cities`.`name` AS `city_name`, `states`.`name` AS `state_name`, `countries`.`name` AS `country_name`
FROM `cities`
JOIN `states` ON `states`.`id` = `cities`.`state_id`
JOIN `countries` ON `countries`.`id` = `cities`.`country_id`
WHERE `cities`.`name` LIKE '%lahore%' ESCAPE '!'
 LIMIT 10
---
    public function getCitySuggestions($term)
    {
        return $this->select('cities.name AS city_name, states.name AS state_name, countries.name AS country_name')
            ->join('states', 'states.id = cities.state_id')
            ->join('countries', 'countries.id = cities.country_id')
            ->like('cities.name', $term)
            ->limit(10)
            ->findAll();